{
  "weddingDate": "2025-11-30T09:00:00Z",
  "Addresses": {
    "Wedding": {
      "venue": "Lake Manor, Chathamma, Cheppanam, Kochi, Kerala 682506, India",
      "mapLink": "https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d15721.995569055602!2d76.3347985!3d9.8923415!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3b0873001ac261bb%3A0x2d08102b43a48b69!2sTHE%20LAKE%20MANOR!5e0!3m2!1sen!2sca!4v1752774837251!5m2!1sen!2sca",
      "description": "The highlight of our journey – a traditional Kerala Hindu wedding by the serene lakeside. Picture the sun reflecting on the water, the air filled with blessings, and pastel-colored sarees and dhotis adding elegance to the setting. Expect heartfelt rituals, laughter, and a promise of forever. Don’t forget to wear your traditional best in soft, graceful tones!",
      "caption": "Join us for the wedding ceremony!",
      "date": "November 30, 2025 at 9:00 AM"
    },
    "Gulabi night": {
      "venue": "Madathiparambil house, Madathiparambil Rd,Panangad, Ernakulam, Kochi, Kerala 682506, India",
      "mapLink": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3930.5738340163525!2d76.32782137450731!3d9.886075174985733!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3b087162f1d15009%3A0x9bb2995fc54579d!2sMadathiparambil%20Rd%2C%20Panangad%2C%20Ernakulam%2C%20Kochi%2C%20Kerala%20682506%2C%20India!5e0!3m2!1sen!2sca!4v1752775333518!5m2!1sen!2sca",
      "description": "An evening drenched in music, laughter, and dance – our Gulabi Night is where the fun truly begins! Think vibrant décor, colorful outfits, and beats that will make you want to stay on the dance floor all night. From impromptu performances to endless selfies, this is the night to let loose and celebrate love in full swing. Traditional Indian attire encouraged, the brighter the better!",
      "caption": "Join us for a night of music and dance!",
      "date": "November 29, 2025 at 6:00 PM"
    },
    "Countdown to Forever": {
      "venue": "Serene Waters, Near, Koombayil Jetty Rd, Panangad, Kochi, Ernakulam, Kerala 682506, India",
      "mapLink": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3930.5339527374495!2d76.31589847450736!3d9.889410374928941!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3b087385e449ab69%3A0x972ef81de04b9273!2sSerene%20Waters!5e0!3m2!1sen!2sca!4v1752775732652!5m2!1sen!2sca",
      "description": "Step into a dreamy afternoon as we begin the countdown to forever! The engagement party is a celebration of love, laughter, and togetherness by the serene waters. Expect floral elegance, heartwarming speeches, and a sprinkle of magic as Nimisha and Umang exchange rings surrounded by their closest family and friends. Dress in floral or pastel tones to match the romantic vibe of the day.",
      "caption": "Join us for the Engagement Party – Countdown to Forever!",
      "date": "November 28, 2025 at 12:00 PM"
    },
    "Nilav": {
      "venue": "Serene Waters, Near, Koombayil Jetty Rd, Panangad, Kochi, Ernakulam, Kerala 682506, India",
      "mapLink": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3930.5339527374495!2d76.31589847450736!3d9.889410374928941!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3b087385e449ab69%3A0x972ef81de04b9273!2sSerene%20Waters!5e0!3m2!1sen!2sca!4v1752775732652!5m2!1sen!2sca",
      "description": "As the moon rises, it’s time to embrace the rhythm of Kerala! ‘Nilav’ is all about naadan vibes — traditional music, local flavors, and pure joy. Expect cultural beats, nostalgic laughter, and the warmth of homegrown celebration. Come dressed in Kerala’s iconic kasavu sarees and mundus as we dance, dine, and make memories under the moonlight.",
      "caption": "Join us for Nilav – Naadan Vibes Only!",
      "date": "November 28, 2025 at 6:00 PM"
    },
    "Reception": {
      "venue": "Queen's Palace & Events, Sukdhara Chowk, Kathmandu 44600, Nepal",
      "mapLink":  "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3531.589899195751!2d85.3467324!3d27.7299457!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x39eb19ebce6272e3%3A0x85371601df64bf79!2sQueen's%20Palace%20%26%20Events!5e0!3m2!1sen!2sca!4v1760890843303!5m2!1sen!2sca",     
      "description": "It’s time to wrap up the celebrations with one grand finale – the Reception! Think endless food, laughter echoing through the hall, and dancing until your feet say no more. This evening is dedicated to fun, togetherness, and creating unforgettable memories with our Nepali family and friends. Dress to impress in formal or semi-formal wear, and come hungry for both food and happiness!",
      "caption": "Celebrate with us at the reception!",
      "date": "December 13, 2025 at 6:00 PM"
    }
  },
  "countdownMessage": "We can't wait to celebrate with you!",
  "invitationMessage": "Join us for our wedding celebration!",
  "storyTitle": "Our Love Story",
  "storyContent": ["He was a gentle, soft-spoken boy from Kathmandu who had come to Bangalore to study and build a future. She was a fun-loving girl from Kochi, full of life, who moved to Bangalore for work. Their paths crossed at the office and that’s where everything began to change. At first, she thought he was arrogant, the kind of person who ignored her on purpose. But beneath that quiet exterior was someone thoughtful.",
  "\n\n Slowly, they became friends. They started talking, laughing, sharing their dreams and hopes one late conversation at a time. Then the pandemic struck, and she decided to move back home to Kochi. It was during her final week in the city that he finally made a move and told her how he felt. She had always liked him too, but cultural differences and the fear of how their families would react held her back. Still, when she learned his feelings were real, she decided to take a leap of faith to give their story a chance.",
  "\n\nWhat followed was a year and a half of long distance love - days filled with longing, and nights kept alive by calls, messages, and quiet laughter over screens. Twice he crossed the miles to see her, each visit weaving them closer together. And together, they made a brave choice to follow their dreams across continents, hand in hand toward a new beginning.",  "\n\nThey came to Canada. Life as international students was tougher than they imagined - long hours, tight budgets, and the pressure of building a future in a new country. But they held on to each other, becoming each other's anchor through every high and low. They completed their master’s degrees and both landed jobs as software developers.",
  "\n\nEventually, they opened up to their families about their relationship. It wasn’t easy - there were moments of doubt, disagreements, and disapproval. But love, patience, and time softened hearts. And slowly, both families came around.\n\nNow, after five years of love, laughter, distance, dreams, and togetherness, they are ready to begin a beautiful new chapter as husband and wife."],
  "photosTitle": "Memories",
  "photosContent": "A collection of our favorite moments together.",
  "eventsTitle": "Wedding Events",
  "eventsContent": "Details about the events leading up to the big day.",
  "poemLines" : [
    "He was the calm of mountain air,",
    "She was the ocean, bold and rare.",
    "Through distance, storms, and fleeting years,",
    "They held on tight to love sincere.",
    "Now hand in hand, their hearts declare,",
    "A lifetime’s journey, love to share."
  ]
}
